     **free
          dcl-s var1 int(3) inz(30);
          dcl-s var2 int(3) inz(40);
          dcl-s var3 int(3);
          dsply 'Hello world';

           var3 = var1 + var2;
           dsply var3;
          *inlr = *on;
