       IDENTIFICATION DIVISION.
       PROGRAM-ID. RITESH.

       DATA DIVISION.
        01 STR PIC X(20).
        01 CHR1 PIC X(1).
        01 CHR2 PIC X(1).
       PROCEDURE DIVISION.
           DISPLAY 'ENTER STRING'.
           ACCEPT STR.
           DISPLAY 'ENTER CHARACTER WHOM YOU WANT TO REPLACE'.
           ACCEPT CHR1.
           DISPLAY 'ENTER CHARACTER WITH WHOM YOU REPLACE'.
           ACCEPT CHR2.
           INSPECT STR REPLACING ALL CHR1 BY CHR2.
           DISPLAY STR.
           STOP RUN.
