       IDENTIFICATION DIVISION.
       PROGRAM-ID. RITESH.

       DATA DIVISION.
        01 CNT PIC 9(2) VALUE 0.
        01 STR PIC X(20) VALUE 'FJHAFREYWLIHFUBFEIKL'.

       PROCEDURE DIVISION.
           INSPECT STR TALLYING CNT FOR ALL 'A'.
           DISPLAY CNT.
           DISPLAY STR.
           STOP RUN.
