       IDENTIFICATION DIVISION.
       PROGRAM-ID. RITESH.

       PROCEDURE DIVISION.
        A-PARA.
           PERFORM B-PARA 5 TIMES.
           STOP RUN.
        B-PARA.
           DISPLAY 'IN B-PARA'.
